posts/a-little-math-would-not-kill-you/index.org
#+BEGIN_COMMENT
.. title: A little math would not kill you!
.. slug: a-little-math-would-not-kill-you
.. date: 2021-05-20 21:44:36 UTC+05:30
.. tags: 
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT


* A little maths would not kill you
Today we are going to make some of the models in Pure Python , without any external library used.

The two models are /K Nearest Neighbors/ and /Stochastic Gradient Descent(SGD)/.SGD is a simple model that is used for regression.

