posts/a-little-math-would-not-kill-you/index.html
<!DOCTYPE html>
<html prefix="" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>A little math would not kill you! | Forked</title>
<link href="../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/dark.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/theme.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Share+Tech+Mono" rel="stylesheet">
<link href="../../assets/css/custom.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://pspiagicw.github.io/posts/a-little-math-would-not-kill-you/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="pspiagicw">
<link rel="prev" href="../quick-and-dirty-machine-learning/" title="Quick and Dirty Machine Learning" type="text/html">
<link rel="next" href="../so-many-outputs/" title="So many outputs!" type="text/html">
<meta property="og:site_name" content="Forked">
<meta property="og:title" content="A little math would not kill you!">
<meta property="og:url" content="https://pspiagicw.github.io/posts/a-little-math-would-not-kill-you/">
<meta property="og:description" content="A little maths would not kill you


Today we are going to make some of the models in Pure Python , without any external library used.



The two models are K Nearest Neighbors and Stochastic Gradient ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-05-20T21:44:36+05:30">
</head>
<body class="hack dark">

<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <div id="container">
         
    <header id="header"><h1 id="brand"><a href="../../" title="Forked" rel="home">

        <span id="blog-title">Forked</span>
    </a></h1>

        

        
    <nav id="menu"><ul>
<li><a href="../../archive.html">Archive</a></li>
                <li><a href="../../categories/">Tags</a></li>
                <li><a href="../../rss.xml">RSS feed</a></li>

    

    
    
    </ul></nav></header><main id="content"><article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">A little math would not kill you!</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    pspiagicw
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-05-20T21:44:36+05:30" itemprop="datePublished" title="2021-05-20 21:44">2021-05-20 21:44</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org9e5b516" class="outline-2">
<h2 id="org9e5b516">A little maths would not kill you</h2>
<div class="outline-text-2" id="text-org9e5b516">
<p>
Today we are going to make some of the models in Pure Python , without any external library used.
</p>

<p>
The two models are <i>K Nearest Neighbors</i> and <i>Stochastic Gradient Descent(SGD)</i>.SGD is a simple model that is used for regression.
</p>
</div>
