posts/a-little-math-would-not-kill-you/index.html

<div id="outline-container-orgda62c88" class="outline-3">
<h3 id="orgda62c88">Neighbor Classifier from scratch</h3>
<div class="outline-text-3" id="text-orgda62c88">
<p>
KNN works by calculating euclidean distance between the current data point and existing data points.
It chooses the closes ones and decides the majority vote as predicted class.
</p>

<p>
We are using OOP in Python , so if you don't know much about OOP in Python you can look here.
</p>

<p>
First let's make a class
</p>
<div class="highlight"><pre><span></span><span class="c1"># Class Custom Neighbos</span>
<span class="k">class</span> <span class="nc">CustonNeighborsClassifier</span><span class="p">:</span>
    <span class="k">pass</span>
</pre></div>
<p>
We have to make a <code>__init__()</code> method which can contain hyperparameters(Parameters that change working of model).In case of KNN <code>K</code> (No of neighbors) is the hyperparameter.
</p>

<p>
As sklearn has default k of 5 , we too will keep it 5 by default.Sklearn calls <code>k</code> as <code>n_neighbors</code>.
</p>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">CustomNeighborsClassifier</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">n_neighbors</span><span class="o">=</span><span class="mi">5</span><span class="p">):</span>
	<span class="c1"># No of close points to consider</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">n_neighbors</span> <span class="o">=</span> <span class="n">n_neighbors</span>
</pre></div>


<p>
Next we need to implement fit method, which would take input and their classes.This would further just store them as class internal variables.
KNN does not do any calculation until you tell it to predict class of new data points.
</p>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">CustomNeighborsClassifier</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">n_neighbors</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">n_neighbors</span> <span class="o">=</span> <span class="n">n_neighbors</span>
    <span class="k">def</span> <span class="nf">fit</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">x</span><span class="p">,</span><span class="n">y</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">x</span> <span class="o">=</span> <span class="n">x</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">y</span> <span class="o">=</span> <span class="n">y</span>
</pre></div>

<p>
Next we need to implement the predict method.This would return a predicted class , using the existing data.
</p>

<p>
For this method , we need to calculate the euclidean distance between the given point and all known points.
Then we need to look at the closes ones(Pick <b>k</b> closes ones).Then look at the majority between them and return predicted class.
We need to import <code>math</code> module for some mathematical calculations.We also need to implement a <code>dist()</code> method to calculate euclidean distance.
We also need <code>Counter</code> from <code>collections</code> module , for counting majority.
</p>

<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">math</span>
<span class="kn">from</span> <span class="nn">collections</span> <span class="kn">import</span> <span class="n">Counter</span>
<span class="k">class</span> <span class="nc">CustomNeighborsClassifier</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">n_neighbors</span><span class="o">=</span><span class="mi">5</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">neighbors</span> <span class="o">=</span> <span class="n">n_neighbors</span>
    <span class="k">def</span> <span class="nf">fit</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">x</span><span class="p">,</span><span class="n">y</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">data</span> <span class="o">=</span> <span class="n">x</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">labels</span> <span class="o">=</span> <span class="n">y</span>
    <span class="k">def</span> <span class="nf">dist</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">given</span><span class="p">,</span><span class="n">actual</span><span class="p">):</span>
	<span class="n">distance</span> <span class="o">=</span> <span class="mi">0</span>
	<span class="k">for</span> <span class="n">given_element</span> <span class="p">,</span> <span class="n">actual_element</span> <span class="ow">in</span> <span class="nb">zip</span><span class="p">(</span><span class="n">given</span><span class="p">,</span><span class="n">actual</span><span class="p">):</span>
	    <span class="n">distance</span> <span class="o">+=</span> <span class="p">(</span><span class="n">given_element</span> <span class="o">-</span> <span class="n">actual_element</span><span class="p">)</span> <span class="o">**</span> <span class="mi">2</span>
	<span class="k">return</span> <span class="n">math</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">distance</span><span class="p">)</span>
    <span class="k">def</span> <span class="nf">predict</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">x</span><span class="p">):</span>
	<span class="n">distance_lists</span> <span class="o">=</span> <span class="p">[</span> <span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">dist</span><span class="p">(</span><span class="n">x</span><span class="p">,</span><span class="bp">self</span><span class="o">.</span><span class="n">x</span><span class="p">[</span><span class="n">i</span><span class="p">]),</span><span class="bp">self</span><span class="o">.</span><span class="n">y</span><span class="p">[</span><span class="n">i</span><span class="p">])</span> <span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="nb">len</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">x</span><span class="p">))</span> <span class="p">]</span>
	<span class="n">distance_lists</span><span class="o">.</span><span class="n">sort</span><span class="p">(</span><span class="n">key</span><span class="o">=</span><span class="k">lambda</span> <span class="n">x</span><span class="p">:</span> <span class="n">x</span><span class="p">[</span><span class="mi">0</span><span class="p">]</span> <span class="p">)</span>
	<span class="n">nearest</span> <span class="o">=</span> <span class="p">[</span> <span class="n">x</span><span class="p">[</span><span class="mi">1</span><span class="p">]</span> <span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="n">distance_lists</span><span class="p">[:</span><span class="bp">self</span><span class="o">.</span><span class="n">neighbors</span><span class="p">]]</span>
	<span class="n">counts</span> <span class="o">=</span> <span class="n">Counter</span><span class="p">(</span><span class="n">nearest</span><span class="p">)</span>
	<span class="n">majority</span> <span class="o">=</span> <span class="kc">None</span>
	<span class="n">majority_number</span> <span class="o">=</span> <span class="nb">float</span><span class="p">(</span><span class="s1">'-inf'</span><span class="p">)</span>
	<span class="k">for</span> <span class="n">i</span><span class="p">,</span><span class="n">j</span> <span class="ow">in</span> <span class="n">counts</span><span class="o">.</span><span class="n">items</span><span class="p">():</span>
	    <span class="k">if</span> <span class="n">j</span> <span class="o">&gt;</span> <span class="n">majority_number</span><span class="p">:</span>
		<span class="n">majority</span> <span class="o">=</span> <span class="n">i</span>
		<span class="n">majority_number</span> <span class="o">=</span> <span class="n">j</span>
	<span class="k">return</span> <span class="n">majority</span>
</pre></div>

<p>
Implementing score method is very easy , as we simply have to compare our own predict method and actual answers and calculate accuracy
</p>


<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">math</span>
<span class="kn">from</span> <span class="nn">collections</span> <span class="kn">import</span> <span class="n">Counter</span>
<span class="k">class</span> <span class="nc">CustomNeighborsClassifier</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">n_neighbors</span><span class="o">=</span><span class="mi">5</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">neighbors</span> <span class="o">=</span> <span class="n">n_neighbors</span>
    <span class="k">def</span> <span class="nf">fit</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">x</span><span class="p">,</span><span class="n">y</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">data</span> <span class="o">=</span> <span class="n">x</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">labels</span> <span class="o">=</span> <span class="n">y</span>
    <span class="k">def</span> <span class="nf">dist</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">given</span><span class="p">,</span><span class="n">actual</span><span class="p">):</span>
	<span class="n">distance</span> <span class="o">=</span> <span class="mi">0</span>
	<span class="k">for</span> <span class="n">given_element</span> <span class="p">,</span> <span class="n">actual_element</span> <span class="ow">in</span> <span class="nb">zip</span><span class="p">(</span><span class="n">given</span><span class="p">,</span><span class="n">actual</span><span class="p">):</span>
	    <span class="n">distance</span> <span class="o">+=</span> <span class="p">(</span><span class="n">given_element</span> <span class="o">-</span> <span class="n">actual_element</span><span class="p">)</span> <span class="o">**</span> <span class="mi">2</span>
	<span class="k">return</span> <span class="n">math</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">distance</span><span class="p">)</span>
    <span class="k">def</span> <span class="nf">predict</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">x</span><span class="p">):</span>
	<span class="n">distance_lists</span> <span class="o">=</span> <span class="p">[</span> <span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">dist</span><span class="p">(</span><span class="n">x</span><span class="p">,</span><span class="bp">self</span><span class="o">.</span><span class="n">x</span><span class="p">[</span><span class="n">i</span><span class="p">]),</span><span class="bp">self</span><span class="o">.</span><span class="n">y</span><span class="p">[</span><span class="n">i</span><span class="p">])</span> <span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="nb">len</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">x</span><span class="p">))</span> <span class="p">]</span>
	<span class="n">distance_lists</span><span class="o">.</span><span class="n">sort</span><span class="p">(</span><span class="n">key</span><span class="o">=</span><span class="k">lambda</span> <span class="n">x</span><span class="p">:</span> <span class="n">x</span><span class="p">[</span><span class="mi">0</span><span class="p">]</span> <span class="p">)</span>
	<span class="n">nearest</span> <span class="o">=</span> <span class="p">[</span> <span class="n">x</span><span class="p">[</span><span class="mi">1</span><span class="p">]</span> <span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="n">distance_lists</span><span class="p">[:</span><span class="bp">self</span><span class="o">.</span><span class="n">neighbors</span><span class="p">]]</span>
	<span class="n">counts</span> <span class="o">=</span> <span class="n">Counter</span><span class="p">(</span><span class="n">nearest</span><span class="p">)</span>
	<span class="n">majority</span> <span class="o">=</span> <span class="kc">None</span>
	<span class="n">majority_number</span> <span class="o">=</span> <span class="nb">float</span><span class="p">(</span><span class="s1">'-inf'</span><span class="p">)</span>
	<span class="k">for</span> <span class="n">i</span><span class="p">,</span><span class="n">j</span> <span class="ow">in</span> <span class="n">counts</span><span class="o">.</span><span class="n">items</span><span class="p">():</span>
	    <span class="k">if</span> <span class="n">j</span> <span class="o">&gt;</span> <span class="n">majority_number</span><span class="p">:</span>
		<span class="n">majority</span> <span class="o">=</span> <span class="n">i</span>
		<span class="n">majority_number</span> <span class="o">=</span> <span class="n">j</span>
	<span class="k">return</span> <span class="n">majority</span>
    <span class="k">def</span> <span class="nf">score</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">x</span><span class="p">,</span><span class="n">y</span><span class="p">):</span>
	<span class="n">total</span> <span class="o">=</span> <span class="nb">len</span><span class="p">(</span><span class="n">y</span><span class="p">)</span>
	<span class="c1"># predictions = [ self.predict(data) for data in x ]</span>
	<span class="n">predictions</span> <span class="o">=</span> <span class="p">[</span> <span class="bp">self</span><span class="o">.</span><span class="n">predict</span><span class="p">(</span><span class="n">data</span><span class="p">)</span> <span class="o">==</span> <span class="n">label</span> <span class="k">for</span> <span class="n">data</span><span class="p">,</span><span class="n">label</span> <span class="ow">in</span> <span class="nb">zip</span><span class="p">(</span><span class="n">x</span><span class="p">,</span><span class="n">y</span><span class="p">)</span> <span class="p">]</span>
	<span class="n">correct</span> <span class="o">=</span> <span class="nb">sum</span><span class="p">(</span><span class="mi">1</span> <span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="n">predictions</span> <span class="k">if</span> <span class="n">x</span> <span class="p">)</span>
	<span class="k">return</span> <span class="nb">float</span><span class="p">(</span><span class="n">correct</span><span class="o">/</span><span class="n">total</span><span class="p">)</span>
</pre></div>


<p>
Here we are using the <code>iris</code> dataset to find our model's accuracy.Using our model is the same as using sklearn's models
<code>fit()</code> for trianing and <code>score()</code> for testing.
</p>

<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">math</span>
<span class="kn">from</span> <span class="nn">collections</span> <span class="kn">import</span> <span class="n">Counter</span>
<span class="kn">from</span> <span class="nn">sklearn.datasets</span> <span class="kn">import</span> <span class="n">load_iris</span>
<span class="kn">from</span> <span class="nn">sklearn.model_selection</span> <span class="kn">import</span> <span class="n">train_test_split</span>
<span class="k">class</span> <span class="nc">CustomNeighborsClassifier</span><span class="p">:</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">n_neighbors</span><span class="o">=</span><span class="mi">5</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">neighbors</span> <span class="o">=</span> <span class="n">n_neighbors</span>
    <span class="k">def</span> <span class="nf">fit</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">x</span><span class="p">,</span><span class="n">y</span><span class="p">):</span>
	<span class="k">assert</span> <span class="nb">len</span><span class="p">(</span><span class="n">x</span><span class="p">)</span> <span class="o">==</span> <span class="nb">len</span><span class="p">(</span><span class="n">y</span><span class="p">)</span> <span class="p">,</span> <span class="s2">"Input and Output dims don't match"</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">data</span> <span class="o">=</span> <span class="n">x</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">labels</span> <span class="o">=</span> <span class="n">y</span>
    <span class="k">def</span> <span class="nf">dist</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">given</span><span class="p">,</span><span class="n">actual</span><span class="p">):</span>
	<span class="n">distance</span> <span class="o">=</span> <span class="mi">0</span>
	<span class="k">assert</span> <span class="nb">len</span><span class="p">(</span><span class="n">given</span><span class="p">)</span> <span class="o">==</span> <span class="nb">len</span><span class="p">(</span><span class="n">actual</span><span class="p">)</span> <span class="p">,</span> <span class="s2">"Dims of input and output differ"</span>
	<span class="k">for</span> <span class="n">given_element</span> <span class="p">,</span> <span class="n">actual_element</span> <span class="ow">in</span> <span class="nb">zip</span><span class="p">(</span><span class="n">given</span><span class="p">,</span><span class="n">actual</span><span class="p">):</span>
	    <span class="n">distance</span> <span class="o">+=</span> <span class="p">(</span><span class="n">given_element</span> <span class="o">-</span> <span class="n">actual_element</span><span class="p">)</span> <span class="o">**</span> <span class="mi">2</span>
	<span class="k">return</span> <span class="n">math</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">distance</span><span class="p">)</span>
    <span class="k">def</span> <span class="nf">predict</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">x</span><span class="p">):</span>
	<span class="n">distance_lists</span> <span class="o">=</span> <span class="p">[</span> <span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">dist</span><span class="p">(</span><span class="n">x</span><span class="p">,</span><span class="bp">self</span><span class="o">.</span><span class="n">data</span><span class="p">[</span><span class="n">i</span><span class="p">]),</span><span class="bp">self</span><span class="o">.</span><span class="n">labels</span><span class="p">[</span><span class="n">i</span><span class="p">])</span> <span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="nb">len</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">data</span><span class="p">))</span> <span class="p">]</span>
	<span class="n">distance_lists</span><span class="o">.</span><span class="n">sort</span><span class="p">(</span><span class="n">key</span><span class="o">=</span><span class="k">lambda</span> <span class="n">x</span><span class="p">:</span> <span class="n">x</span><span class="p">[</span><span class="mi">0</span><span class="p">]</span> <span class="p">)</span>
	<span class="n">nearest</span> <span class="o">=</span> <span class="p">[</span> <span class="n">x</span><span class="p">[</span><span class="mi">1</span><span class="p">]</span> <span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="n">distance_lists</span><span class="p">[:</span><span class="bp">self</span><span class="o">.</span><span class="n">neighbors</span><span class="p">]]</span>
	<span class="n">counts</span> <span class="o">=</span> <span class="n">Counter</span><span class="p">(</span><span class="n">nearest</span><span class="p">)</span>
	<span class="n">majority</span> <span class="o">=</span> <span class="kc">None</span>
	<span class="n">majority_number</span> <span class="o">=</span> <span class="nb">float</span><span class="p">(</span><span class="s1">'-inf'</span><span class="p">)</span>
	<span class="k">for</span> <span class="n">i</span><span class="p">,</span><span class="n">j</span> <span class="ow">in</span> <span class="n">counts</span><span class="o">.</span><span class="n">items</span><span class="p">():</span>
	    <span class="k">if</span> <span class="n">j</span> <span class="o">&gt;</span> <span class="n">majority_number</span><span class="p">:</span>
		<span class="n">majority</span> <span class="o">=</span> <span class="n">i</span>
		<span class="n">majority_number</span> <span class="o">=</span> <span class="n">j</span>
	<span class="k">return</span> <span class="n">majority</span>
    <span class="k">def</span> <span class="nf">score</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span><span class="n">x</span><span class="p">,</span><span class="n">y</span><span class="p">):</span>
	<span class="n">total</span> <span class="o">=</span> <span class="nb">len</span><span class="p">(</span><span class="n">y</span><span class="p">)</span>
	<span class="c1"># predictions = [ self.predict(data) for data in x ]</span>
	<span class="n">predictions</span> <span class="o">=</span> <span class="p">[</span> <span class="bp">self</span><span class="o">.</span><span class="n">predict</span><span class="p">(</span><span class="n">data</span><span class="p">)</span> <span class="o">==</span> <span class="n">label</span> <span class="k">for</span> <span class="n">data</span><span class="p">,</span><span class="n">label</span> <span class="ow">in</span> <span class="nb">zip</span><span class="p">(</span><span class="n">x</span><span class="p">,</span><span class="n">y</span><span class="p">)</span> <span class="p">]</span>
	<span class="n">correct</span> <span class="o">=</span> <span class="nb">sum</span><span class="p">(</span><span class="mi">1</span> <span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="n">predictions</span> <span class="k">if</span> <span class="n">x</span> <span class="p">)</span>
	<span class="k">return</span> <span class="nb">float</span><span class="p">(</span><span class="n">correct</span><span class="o">/</span><span class="n">total</span><span class="p">)</span>

<span class="k">def</span> <span class="nf">main</span><span class="p">():</span>
    <span class="n">rawdata</span> <span class="o">=</span> <span class="n">load_iris</span><span class="p">()</span>
    <span class="n">x</span> <span class="o">=</span> <span class="n">rawdata</span><span class="p">[</span><span class="s1">'data'</span><span class="p">]</span>
    <span class="n">y</span> <span class="o">=</span> <span class="n">rawdata</span><span class="p">[</span><span class="s1">'target'</span><span class="p">]</span>
    <span class="n">train_x</span> <span class="p">,</span> <span class="n">test_x</span> <span class="p">,</span> <span class="n">train_y</span> <span class="p">,</span> <span class="n">test_y</span> <span class="o">=</span> <span class="n">train_test_split</span><span class="p">(</span><span class="n">x</span><span class="p">,</span><span class="n">y</span><span class="p">)</span>
    <span class="n">model</span> <span class="o">=</span> <span class="n">CustomNeighborsClassifier</span><span class="p">(</span><span class="n">n_neighbors</span><span class="o">=</span><span class="mi">7</span><span class="p">)</span>
    <span class="n">model</span><span class="o">.</span><span class="n">fit</span><span class="p">(</span><span class="n">train_x</span><span class="p">,</span><span class="n">train_y</span><span class="p">)</span>
    <span class="nb">print</span><span class="p">(</span><span class="n">model</span><span class="o">.</span><span class="n">score</span><span class="p">(</span><span class="n">test_x</span><span class="p">,</span> <span class="n">test_y</span><span class="p">))</span>
<span class="n">main</span><span class="p">()</span>
</pre></div>


<p>
97%!! , our model performs very good at predicting.
</p>

<p>
Now that you have information about how KNN works on the inside , try to code this without looking at this blog , share your accuracy acheived.
</p>
</div>
</div>
