posts/a-little-math-would-not-kill-you/index.org
** Regression from Scratch(SGD)
This SGD Regressor implementation , try to understand this code by researching on SGD .This is more for my personal reference than explanation.

The most important step is in the ~fit()~ method.

Refer to this article for more information on SGD.

#+begin_src python :results output :session
import numpy as np
from sklearn.datasets import fetch_california_housing
import random
from sklearn.model_selection import train_test_split
class CustomSGD:
    def __init__(self,lr=0.0000001):
        self.lr = lr
    def fit(self,x,y):
        self.dims = len(x[0])
        self.coef_ = [ random.random() for _ in range(self.dims) ]
        for data_point,label in zip(x,y):
            prediction = np.dot(data_point,self.coef_)
            error = label - prediction
            self.coef_ += np.dot(data_point,error) * self.lr

    def predict(self,x):
        assert len(x) == self.dims , "Input dims don't match training dim"
        prediction = np.dot(self.coef_,x)
        return prediction
    def score(self,given,actual):
        total_error = 0
        for given_element,actual_element in zip(given,actual):
            error = ( self.predict(given_element) - actual_element) ** 2
            total_error += error
        mse = math.sqrt(total_error)/len(given)
        avg = sum(actual) / len(given)
        return (mse/avg) * 100
def main():
    rawdata = fetch_california_housing()
    x = rawdata['data']
    y = rawdata['target']
    train_x , test_x , train_y , test_y = train_test_split(x,y,random_state=0)
    model = CustomSGD()
    model.fit(train_x,train_y)
    print(model.score(test_x, test_y))
main()
#+end_src

